Revit 2027 API
ExportPatternTable Properties
The ExportPatternTable type exposes the following members.
Properties
Name | Description
Count |  Count of the items contained in the collection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Item |  A copy of the ExportPatternInfo for the pattern's ExportPatternKey.
Top
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace